{
 "class_name": "Sequential",
 "config": {
  "name": "sequential_14",
  "layers": [
   {
    "class_name": "InputLayer",
    "config": {
     "batch_input_shape": [
      null,
      784
     ],
     "dtype": "float32",
     "sparse": false,
     "ragged": false,
     "name": "dense_65_input"
    }
   },
   {
    "class_name": "Dense",
    "config": {
     "name": "dense_65",
     "trainable": true,
     "batch_input_shape": [
      null,
      784
     ],
     "dtype": "float32",
     "units": 256,
     "activation": "gelu",
     "use_bias": true,
     "kernel_initializer": {
      "class_name": "GlorotUniform",
      "config": {
       "seed": null
      }
     },
     "bias_initializer": {
      "class_name": "Zeros",
      "config": {}
     },
     "kernel_regularizer": null,
     "bias_regularizer": null,
     "activity_regularizer": null,
     "kernel_constraint": null,
     "bias_constraint": null
    }
   },
   {
    "class_name": "BatchNormalization",
    "config": {
     "name": "batch_normalization_36",
     "trainable": true,
     "dtype": "float32",
     "axis": [
      1
     ],
     "momentum": 0.99,
     "epsilon": 0.001,
     "center": true,
     "scale": true,
     "beta_initializer": {
      "class_name": "Zeros",
      "config": {}
     },
     "gamma_initializer": {
      "class_name": "Ones",
      "config": {}
     },
     "moving_mean_initializer": {
      "class_name": "Zeros",
      "config": {}
     },
     "moving_variance_initializer": {
      "class_name": "Ones",
      "config": {}
     },
     "beta_regularizer": null,
     "gamma_regularizer": null,
     "beta_constraint": null,
     "gamma_constraint": null
    }
   },
   {
    "class_name": "Dropout",
    "config": {
     "name": "dropout_36",
     "trainable": true,
     "dtype": "float32",
     "rate": 0.2,
     "noise_shape": null,
     "seed": null
    }
   },
   {
    "class_name": "Dense",
    "config": {
     "name": "dense_66",
     "trainable": true,
     "dtype": "float32",
     "units": 128,
     "activation": "gelu",
     "use_bias": true,
     "kernel_initializer": {
      "class_name": "GlorotUniform",
      "config": {
       "seed": null
      }
     },
     "bias_initializer": {
      "class_name": "Zeros",
      "config": {}
     },
     "kernel_regularizer": null,
     "bias_regularizer": null,
     "activity_regularizer": null,
     "kernel_constraint": null,
     "bias_constraint": null
    }
   },
   {
    "class_name": "BatchNormalization",
    "config": {
     "name": "batch_normalization_37",
     "trainable": true,
     "dtype": "float32",
     "axis": [
      1
     ],
     "momentum": 0.99,
     "epsilon": 0.001,
     "center": true,
     "scale": true,
     "beta_initializer": {
      "class_name": "Zeros",
      "config": {}
     },
     "gamma_initializer": {
      "class_name": "Ones",
      "config": {}
     },
     "moving_mean_initializer": {
      "class_name": "Zeros",
      "config": {}
     },
     "moving_variance_initializer": {
      "class_name": "Ones",
      "config": {}
     },
     "beta_regularizer": null,
     "gamma_regularizer": null,
     "beta_constraint": null,
     "gamma_constraint": null
    }
   },
   {
    "class_name": "Dropout",
    "config": {
     "name": "dropout_37",
     "trainable": true,
     "dtype": "float32",
     "rate": 0.2,
     "noise_shape": null,
     "seed": null
    }
   },
   {
    "class_name": "Dense",
    "config": {
     "name": "dense_67",
     "trainable": true,
     "dtype": "float32",
     "units": 25,
     "activation": "gelu",
     "use_bias": true,
     "kernel_initializer": {
      "class_name": "GlorotUniform",
      "config": {
       "seed": null
      }
     },
     "bias_initializer": {
      "class_name": "Zeros",
      "config": {}
     },
     "kernel_regularizer": null,
     "bias_regularizer": null,
     "activity_regularizer": null,
     "kernel_constraint": null,
     "bias_constraint": null
    }
   },
   {
    "class_name": "Dense",
    "config": {
     "name": "dense_68",
     "trainable": true,
     "dtype": "float32",
     "units": 128,
     "activation": "gelu",
     "use_bias": true,
     "kernel_initializer": {
      "class_name": "GlorotUniform",
      "config": {
       "seed": null
      }
     },
     "bias_initializer": {
      "class_name": "Zeros",
      "config": {}
     },
     "kernel_regularizer": null,
     "bias_regularizer": null,
     "activity_regularizer": null,
     "kernel_constraint": null,
     "bias_constraint": null
    }
   },
   {
    "class_name": "BatchNormalization",
    "config": {
     "name": "batch_normalization_38",
     "trainable": true,
     "dtype": "float32",
     "axis": [
      1
     ],
     "momentum": 0.99,
     "epsilon": 0.001,
     "center": true,
     "scale": true,
     "beta_initializer": {
      "class_name": "Zeros",
      "config": {}
     },
     "gamma_initializer": {
      "class_name": "Ones",
      "config": {}
     },
     "moving_mean_initializer": {
      "class_name": "Zeros",
      "config": {}
     },
     "moving_variance_initializer": {
      "class_name": "Ones",
      "config": {}
     },
     "beta_regularizer": null,
     "gamma_regularizer": null,
     "beta_constraint": null,
     "gamma_constraint": null
    }
   },
   {
    "class_name": "Dropout",
    "config": {
     "name": "dropout_38",
     "trainable": true,
     "dtype": "float32",
     "rate": 0.2,
     "noise_shape": null,
     "seed": null
    }
   },
   {
    "class_name": "Dense",
    "config": {
     "name": "dense_69",
     "trainable": true,
     "dtype": "float32",
     "units": 256,
     "activation": "gelu",
     "use_bias": true,
     "kernel_initializer": {
      "class_name": "GlorotUniform",
      "config": {
       "seed": null
      }
     },
     "bias_initializer": {
      "class_name": "Zeros",
      "config": {}
     },
     "kernel_regularizer": null,
     "bias_regularizer": null,
     "activity_regularizer": null,
     "kernel_constraint": null,
     "bias_constraint": null
    }
   },
   {
    "class_name": "BatchNormalization",
    "config": {
     "name": "batch_normalization_39",
     "trainable": true,
     "dtype": "float32",
     "axis": [
      1
     ],
     "momentum": 0.99,
     "epsilon": 0.001,
     "center": true,
     "scale": true,
     "beta_initializer": {
      "class_name": "Zeros",
      "config": {}
     },
     "gamma_initializer": {
      "class_name": "Ones",
      "config": {}
     },
     "moving_mean_initializer": {
      "class_name": "Zeros",
      "config": {}
     },
     "moving_variance_initializer": {
      "class_name": "Ones",
      "config": {}
     },
     "beta_regularizer": null,
     "gamma_regularizer": null,
     "beta_constraint": null,
     "gamma_constraint": null
    }
   },
   {
    "class_name": "Dropout",
    "config": {
     "name": "dropout_39",
     "trainable": true,
     "dtype": "float32",
     "rate": 0.2,
     "noise_shape": null,
     "seed": null
    }
   },
   {
    "class_name": "Dense",
    "config": {
     "name": "dense_70",
     "trainable": true,
     "dtype": "float32",
     "units": 784,
     "activation": "sigmoid",
     "use_bias": true,
     "kernel_initializer": {
      "class_name": "GlorotUniform",
      "config": {
       "seed": null
      }
     },
     "bias_initializer": {
      "class_name": "Zeros",
      "config": {}
     },
     "kernel_regularizer": null,
     "bias_regularizer": null,
     "activity_regularizer": null,
     "kernel_constraint": null,
     "bias_constraint": null
    }
   }
  ]
 },
 "keras_version": "2.8.0",
 "backend": "tensorflow"
}